import styled from "styled-components";
import { Header } from "../../components/Header";

export const NoteDetailPage = () => {
    return (
        <Wrapper>
            <Header />
            <Box>
                <Date>2024년 5월 29일 📆</Date>
                <SubjectName>수학</SubjectName>
                <Content>
                    00아 그거 알아? 사람이 너무 예쁜걸 보면 단기기억상실증에 걸린대... 00아 그거 알아? 사람이 너무
                    예쁜걸 보면 단기기억상실증에 걸린대... 00아 그거 알아? ​ 혹시 접착제 좀 빌릴 수 있을까요? 당신에게
                    말 좀 붙이게요..☆ ​ 너 때문에 비온다... 심장마비 ​ 너 혼혈이라며? 천국과 한국 ​ 초콜릿 공장이 다
                    망했다고 하더라. 네가 너무 달콤해서. ​ 널 음계로 표현하면 "레"가 아닐까? 도는 넘었고 미치기
                    직전이니까. ​ 혹시 좋아하는 신 있어? 나는 당신..☆ ​ 너 KT에서 고소당했다며? 너무 giga 막혀서... ​ 넌
                    치과에서 일하면 좋을 거 같아. 너러 보면 입을 다물 수가 없거든 ​ 그거 알아? 너 좋아하는 사람 손가락
                    반으로 접어! 했더니 지구가 반으로 접힌거 ​ 넌 린스할 필요 없겠다. 네가 프린스라서 ​ 네 MBTI 알겠다!
                    C.U.T.E 맞지? ​ 네 사진 좀 줘. 정전되면 불 좀 밝히게. 흙한테 네 목소리 들려줬더니 너무 달달해서
                    흑설탕 됐어. ​ 난 걷는 걸 좋아하는데 널 만난 이후로 항상 뛰어, 내 심장이. ​ 일주일은 6일이야. 왠 줄
                    알아? 널 기다리느라 '목'이 빠졌거든. ​ 바다가 보이면 오션뷰, 도시가 보이면 시티뷰, 네가 보이면
                    알라뷰♡ ​ 한국은 삼면이 아니라 사면이 바다래. 동해, 서해, 남해, 그리고 OO아 사랑해 ​ OO이 너무
                    좋아서 벽치다가 우리집 원룸 됐잖아 ㅠ ​ 나 너 때문에 탈모 생겼잖아. 너한테 '헤어' 나올 수 없어서. ​
                    네 얼굴은 솔직히 유료화 해야된다. '무료'할 수가 없으니까. ​ 난 '마'로 시작하는 거 다 좋아해.
                    마시멜로, 마라탕, 마카롱, 그리고 마성의 매력을 소지한 OOO ​ 오빠 잘생겨서 윈드밀 돌았더니
                    풍력발전소에서 나 스카웃 함 ​ 너 때문에 전쟁났어. 귀여war, 사랑스러war ​ 집 갈 때 대중교통 타시나요?
                    지하철? 버스? 그런거 말고 나랑 썸 탑시다. ​ 너 감옥갈뻔 했어 나 심쿵사 할뻔 했잖아. ​ 나 오늘
                    수영배웠어 너에게 빠지지 않으려고 ​ oo씨 예민한 질문일 수 도 있지만 너무 궁금해서 물어봅니다. oo씨는
                    천국에서 쫓겨난 건가요 자발적으로 내려온 건가요 아님 추락 사고 였나요? ​ 산타가 나에게 물었다.
                    "얘야, 어떤 선물을 갖고 싶니?" 나는 웃으며 말했다. "100억이요!" 그러자 산타는 "좀 더 특별한건 없니?"
                    라고 되물었다. 나는 대답했다. "... OO이를 그만 사랑하는 방법이요.." 그러자 산타는 미소지으며 말했다.
                    "계좌번호좀 불러줄래?" ​ OO이 승마장 출입금지당했어요... 왜인지 알아요? OO이 외모 보면 말이 안
                    나와서... ​ OO이 사진 보다가 심장 녹을까봐 냉동실에서 사진 보는 중이에요;; ​ - 나 얼마나 기다렸어 -
                    얼마 안기다렸어 - 거짓말 하지마, 얼마나 기다렸는데 - ... - 신호등이 638번 바뀔동안 ​ "엄마 쟤 이름은
                    왜 '장미'에요?" "그건 저 아이의 엄마가 장미를 좋아하기 때문이란다." "그럼 제 이름은 왜 이래요?"
                    "그래, OO이아." ​ 곤충학대 논란 해명해주세요... oo이 얼굴 개미쳤잖아요 ​ 5점 만점에 4.9점
                    드리겠습니다 그녀에게 '오점'이란 없으니 ​ 너네 oo이 화나면 어떻게 되는지 알고 있냐? 그때부터
                    '신'화가 시작된다 ​ 공룡이 왜 멸종된줄 알아여 OO이미모를 보고 박수를 안춰서 내가 다 없애버림 ​ OO이
                    그거 기억나요? 사람들 한테 OO이 좋아하는 사람 손 접어 했더니 지구가 반으로 접힌거 그거 겨우겨우
                    되돌렸잖아요 나 그 때 내 눈 앞에 브라질 있어서 깜짝 놀랐잖아
                </Content>
            </Box>
        </Wrapper>
    );
};

const Wrapper = styled.div`
    display: flex;
    flex-direction: column;
    align-items: center;
`;

const Box = styled.div`
    display: flex;
    flex-direction: column;
    gap: 45px;
    width: 906px;
    padding: 27px;
    margin-top: 109px;
    @media (max-width: 1200px) {
        width: 850px;
    }
    @media (max-width: 1000px) {
        width: 750px;
    }
    @media (max-width: 800px) {
        width: 600px;
    }
    @media (max-width: 600px) {
        width: 500px;
    }
`;

const Date = styled.p`
    font-size: 38px;
    font-weight: 700;
`;

const SubjectName = styled.p`
    font-size: 25px;
    font-weight: 600;
`;

const Content = styled.p`
    font-size: 17px;
    font-weight: 500;
`;
